# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsArray..::..Append Method
CurveByPointsArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	CurveByPoints item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As CurveByPoints _
)
```

Visual C++
---
```text
public:
virtual void Append(
	CurveByPoints^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CurveByPoints
# See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace